## Target env: terraform/env
#### Terraform Init `success`
#### Terraform Validate `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.eks.data.aws_region.current: Reading...
module.eks.data.aws_eks_cluster_auth.cluster_auth: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ddc9693e04058768]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00d69a9c0eca22428]
module.eks.data.aws_iam_policy_document.assume_role: Reading...
data.aws_caller_identity.current: Reading...
module.cluster_encription_key.aws_kms_key.key: Refreshing state... [id=904d45ee-0266-42b4-924e-8d7af4a1de7b]
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.eks.data.aws_eks_cluster_auth.cluster_auth: Read complete after 0s [id=ipro-2023-eks-cluster]
module.eks.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=189502314]
module.eks.aws_iam_role.cluster: Refreshing state... [id=ipro-2023-role]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=686355260515]
data.aws_caller_identity.current: Read complete after 0s [id=686355260515]
module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=ipro-2023-role-20230708135227798700000002]
module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=ipro-2023-role-20230708135227794400000001]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0469991642125f7a2]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-08c05836d2aaa2a76]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-076b5b28f56364016]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bfff3212e86623a6]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b1599fca838224b7]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0f1da7f2b33ebf68f]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0297f532d7a4d9091]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f3eefd9a67cb3abb]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-006aaa6573cd74e3a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0041366317ae89b9f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ad4b086a5c2925a1]
module.eks.aws_security_group.cluster_shared: Refreshing state... [id=sg-00fb11e31896c1a40]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01f14c6a5a5e599e6]
module.eks.aws_security_group.control_plane: Refreshing state... [id=sg-0f6a9b28ff4e34a1f]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-013235eff887f201e]
module.eks.aws_security_group_rule.inter_node: Refreshing state... [id=sgrule-2339350107]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d8283827dd3509c3]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01f14c6a5a5e599e61080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01dffe1ff940459e7]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06d52363b63635f18]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-00c764b5cb89ab25b]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-034be660a67fd2ecd]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05bca5ac24f97c862]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e0a67aba0e9f7dcc]
module.eks.aws_eks_cluster.cluster: Refreshing state... [id=ipro-2023-eks-cluster]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f3eefd9a67cb3abb1080289494]
module.eks.aws_security_group_rule.node_to_default_cluster: Refreshing state... [id=sgrule-2683651886]
module.eks.aws_security_group_rule.default_cluster_to_node: Refreshing state... [id=sgrule-824233390]
module.eks.data.tls_certificate.cluster: Reading...
module.eks.data.aws_iam_policy_document.pod_execution_role: Reading...
module.eks.data.aws_iam_policy_document.pod_execution_role: Read complete after 0s [id=1722845150]
module.eks.aws_iam_role.pod_execution_role: Refreshing state... [id=ipro-2023-pod-execution-role]
kubernetes_config_map.aws_auth: Refreshing state... [id=kube-system/aws-auth]
aws_eks_fargate_profile.kube-system_eks_node: Refreshing state... [id=ipro-2023-eks-cluster:ipro-2023-kube-system-fargate-profile]
module.eks.aws_iam_role_policy_attachment.pod_execution_role: Refreshing state... [id=ipro-2023-pod-execution-role-20230708135953730300000006]
aws_eks_fargate_profile.app_eks_node: Refreshing state... [id=ipro-2023-eks-cluster:ipro-2023-app-fargate-profile]
module.eks.aws_iam_role_policy_attachment.pod_execution_role_ecr: Refreshing state... [id=ipro-2023-pod-execution-role-20230708135953777200000007]
module.eks.data.tls_certificate.cluster: Read complete after 0s [id=876ec6096b3f2e9d22b7016d735a7689929468a2]
module.eks.aws_iam_openid_connect_provider.cluster: Refreshing state... [id=arn:aws:iam::686355260515:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/9E18A9EBE551842B15641BFBDEFB50EC]
module.eks.data.aws_iam_policy_document.assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=256746824]
module.eks.aws_iam_role.oidc: Refreshing state... [id=eks-odic-role]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_fargate_profile.app_eks_node is tainted, so must be replaced
-/+ resource "aws_eks_fargate_profile" "app_eks_node" {
      ~ arn                    = "arn:aws:eks:ap-northeast-1:686355260515:fargateprofile/ipro-2023-eks-cluster/ipro-2023-app-fargate-profile/b2c49ae7-05dc-c347-c889-a7eed01269e8" -> (known after apply)
      ~ id                     = "ipro-2023-eks-cluster:ipro-2023-app-fargate-profile" -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)

      - selector {
          - labels    = {} -> null
          - namespace = "app" -> null
        }
      + selector {
          + namespace = "app"
        }
    }

  # aws_eks_fargate_profile.kube-system_eks_node is tainted, so must be replaced
-/+ resource "aws_eks_fargate_profile" "kube-system_eks_node" {
      ~ arn                    = "arn:aws:eks:ap-northeast-1:686355260515:fargateprofile/ipro-2023-eks-cluster/ipro-2023-kube-system-fargate-profile/e8c49ae6-cf81-08fe-9df8-b16bf3c62b64" -> (known after apply)
      ~ id                     = "ipro-2023-eks-cluster:ipro-2023-kube-system-fargate-profile" -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)

      - selector {
          - labels    = {} -> null
          - namespace = "kube-system" -> null
        }
      + selector {
          + namespace = "kube-system"
        }
    }

  # kubernetes_cluster_role_binding.aws-auth will be created
  + resource "kubernetes_cluster_role_binding" "aws-auth" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "eks-console-dashboard-full-access-binding"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "eks-console-dashboard-full-access-clusterrole"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "eks-console-dashboard-full-access-group"
          + namespace = "default"
        }
    }

  # kubernetes_config_map.aws_auth will be updated in-place
  ~ resource "kubernetes_config_map" "aws_auth" {
      ~ data        = {
          - "mapRoles" = <<-EOT
                - rolearn = "arn:aws:iam::686355260515:role/*"
                  username: system:node:{{EC2PrivateDNSName}}
                  groups:
                    - system:bootstrappers
                    - system:nodes
            EOT -> null
          + "mapUsers" = <<-EOT
                - userarn = "arn:aws:iam::686355260515:user/cli-user"
                  username: admin
                  groups:
                    - system:bootstrappers
                    - system:nodes
                    - eks-console-dashboard-full-access-binding"
                - userarn = "arn:aws:iam::686355260515:user/naruse"
                  username: admin
                  groups:
                    - system:bootstrappers
                    - system:nodes
                    - eks-console-dashboard-full-access-binding"
            EOT
        }
        id          = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_role_binding.aws-auth will be created
  + resource "kubernetes_role_binding" "aws-auth" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "eks-console-dashboard-restricted-access-role-binding"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "eks-console-dashboard-restricted-access-role"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "eks-console-dashboard-restricted-access-group"
          + namespace = "default"
        }
    }

  # module.cluster_encription_key.aws_kms_key_policy.key_policy will be created
  + resource "aws_kms_key_policy" "key_policy" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = "904d45ee-0266-42b4-924e-8d7af4a1de7b"
      + policy                             = "\"{\\n    Statement = [\\n      {\\n        Action = \\\"kms:*\\\"\\n        Effect = \\\"Allow\\\"\\n        Principal = {\\n          \\\"AWS\\\" = arn:aws:sts::686355260515:assumed-role/AllowAccessFromIpro2023/GitHubActions\\\"\\n          }\\n\\n        Resource = \\\"*\\\"\\n        Sid      = \\\"EKS Cluster Encription Key\\\"\\n      },\\n    ]\\n    Version = \\\"2012-10-17\\\"\\n}\\n\""
    }

Plan: 5 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>